cmsis-svd/cmsis-svd/data/Holtek/HT32F1655_56.svd
        <!--PWRCU_BAKREG0-->
        <register>
          <name>PWRCU_BAKREG0</name>
          <displayName>PWRCU_BAKREG0</displayName>
          <description>PWRCU_BAKREG0</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>BAKREG</name>
              <description>BAKREG</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--PWRCU_BAKREG1-->
        <register>
          <name>PWRCU_BAKREG1</name>
          <displayName>PWRCU_BAKREG1</displayName>
          <description>PWRCU_BAKREG1</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>BAKREG</name>
              <description>BAKREG</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--PWRCU_BAKREG2-->
        <register>
          <name>PWRCU_BAKREG2</name>
          <displayName>PWRCU_BAKREG2</displayName>
          <description>PWRCU_BAKREG2</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>BAKREG</name>
              <description>BAKREG</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--PWRCU_BAKREG3-->
        <register>
          <name>PWRCU_BAKREG3</name>
          <displayName>PWRCU_BAKREG3</displayName>
          <description>PWRCU_BAKREG3</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>BAKREG</name>
              <description>BAKREG</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--PWRCU_BAKREG4-->
        <register>
          <name>PWRCU_BAKREG4</name>
          <displayName>PWRCU_BAKREG4</displayName>
          <description>PWRCU_BAKREG4</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>BAKREG</name>
              <description>BAKREG</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--PWRCU_BAKREG5-->
        <register>
          <name>PWRCU_BAKREG5</name>
          <displayName>PWRCU_BAKREG5</displayName>
          <description>PWRCU_BAKREG5</description>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>BAKREG</name>
              <description>BAKREG</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--PWRCU_BAKREG6-->
        <register>
          <name>PWRCU_BAKREG6</name>
          <displayName>PWRCU_BAKREG6</displayName>
          <description>PWRCU_BAKREG6</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>BAKREG</name>
              <description>BAKREG</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--PWRCU_BAKREG7-->
        <register>
          <name>PWRCU_BAKREG7</name>
          <displayName>PWRCU_BAKREG7</displayName>
          <description>PWRCU_BAKREG7</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>BAKREG</name>
              <description>BAKREG</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--PWRCU_BAKREG8-->
        <register>
          <name>PWRCU_BAKREG8</name>
          <displayName>PWRCU_BAKREG8</displayName>
          <description>PWRCU_BAKREG8</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>BAKREG</name>
              <description>BAKREG</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--PWRCU_BAKREG9-->
        <register>
          <name>PWRCU_BAKREG9</name>
          <displayName>PWRCU_BAKREG9</displayName>
          <description>PWRCU_BAKREG9</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>BAKREG</name>
              <description>BAKREG</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
