cmsis-svd/cmsis-svd/data/Holtek/HT32F1655_56.svd
      </registers>
    </peripheral>
    <!--ADC-->
    <peripheral>
      <name>ADC</name>
      <version>1.1</version>
      <description>ADC</description>
      <groupName>ADC</groupName>
      <baseAddress>0x40010000</baseAddress>
      <size>32</size><!--Bits-->
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size><!--Bytes-->
        <usage>registers</usage><!--registers/buffer/reserved-->
      </addressBlock>
      <interrupt>
        <name>ADC</name>
        <value>25</value>
      </interrupt>
      <registers>
        <!--ADC_RST-->
        <register>
          <name>ADC_RST</name>
          <displayName>ADC_RST</displayName>
          <description>ADC_RST</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADRST</name>
              <description>ADRST</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_CONV-->
        <register>
          <name>ADC_CONV</name>
          <displayName>ADC_CONV</displayName>
          <description>ADC_CONV</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADMODE</name>
              <description>ADMODE</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSEQL</name>
              <description>ADSEQL</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSUBL</name>
              <description>ADSUBL</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_HCONV-->
        <register>
          <name>ADC_HCONV</name>
          <displayName>ADC_HCONV</displayName>
          <description>ADC_HCONV</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADHMODE</name>
              <description>ADHMODE</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADHSEQL</name>
              <description>ADHSEQL</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADHSUBL</name>
              <description>ADHSUBL</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_LST0-->
        <register>
          <name>ADC_LST0</name>
          <displayName>ADC_LST0</displayName>
          <description>ADC_LST0</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADSEQ0</name>
              <description>ADSEQ0</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSEQ1</name>
              <description>ADSEQ1</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSEQ2</name>
              <description>ADSEQ2</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSEQ3</name>
              <description>ADSEQ3</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_LST1-->
        <register>
          <name>ADC_LST1</name>
          <displayName>ADC_LST1</displayName>
          <description>ADC_LST1</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADSEQ4</name>
              <description>ADSEQ4</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSEQ5</name>
              <description>ADSEQ5</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSEQ6</name>
              <description>ADSEQ6</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSEQ7</name>
              <description>ADSEQ7</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_LST2-->
        <register>
          <name>ADC_LST2</name>
          <displayName>ADC_LST2</displayName>
          <description>ADC_LST2</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADSEQ8</name>
              <description>ADSEQ8</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSEQ9</name>
              <description>ADSEQ9</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSEQ10</name>
              <description>ADSEQ10</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSEQ11</name>
              <description>ADSEQ11</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_LST3-->
        <register>
          <name>ADC_LST3</name>
          <displayName>ADC_LST3</displayName>
          <description>ADC_LST3</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADSEQ12</name>
              <description>ADSEQ12</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSEQ13</name>
              <description>ADSEQ13</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSEQ14</name>
              <description>ADSEQ14</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSEQ15</name>
              <description>ADSEQ15</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
