cmsis-svd/cmsis-svd/data/Holtek/HT32F1655_56.svd
        <!--ADC_STR12-->
        <register>
          <name>ADC_STR12</name>
          <displayName>ADC_STR12</displayName>
          <description>ADC_STR12</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADST12</name>
              <description>ADST12</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_STR13-->
        <register>
          <name>ADC_STR13</name>
          <displayName>ADC_STR13</displayName>
          <description>ADC_STR13</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADST13</name>
              <description>ADST13</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_STR14-->
        <register>
          <name>ADC_STR14</name>
          <displayName>ADC_STR14</displayName>
          <description>ADC_STR14</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADST14</name>
              <description>ADST14</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_STR15-->
        <register>
          <name>ADC_STR15</name>
          <displayName>ADC_STR15</displayName>
          <description>ADC_STR15</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADST15</name>
              <description>ADST15</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_DR0-->
        <register>
          <name>ADC_DR0</name>
          <displayName>ADC_DR0</displayName>
          <description>ADC_DR0</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADD0</name>
              <description>ADD0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADVLD0</name>
              <description>ADVLD0</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_DR1-->
        <register>
          <name>ADC_DR1</name>
          <displayName>ADC_DR1</displayName>
          <description>ADC_DR1</description>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADD1</name>
              <description>ADD1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADVLD1</name>
              <description>ADVLD1</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_DR2-->
        <register>
          <name>ADC_DR2</name>
          <displayName>ADC_DR2</displayName>
          <description>ADC_DR2</description>
          <addressOffset>0x000000B8</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADD2</name>
              <description>ADD2</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADVLD2</name>
              <description>ADVLD2</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_DR3-->
        <register>
          <name>ADC_DR3</name>
          <displayName>ADC_DR3</displayName>
          <description>ADC_DR3</description>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADD3</name>
              <description>ADD3</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADVLD3</name>
              <description>ADVLD3</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_DR4-->
        <register>
          <name>ADC_DR4</name>
          <displayName>ADC_DR4</displayName>
          <description>ADC_DR4</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADD4</name>
              <description>ADD4</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADVLD4</name>
              <description>ADVLD4</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
