cmsis-svd/cmsis-svd/data/Holtek/HT32F1655_56.svd
        <!--GPTM0_CH0CCR-->
        <register>
          <name>GPTM_CH0CCR</name>
          <displayName>GPTM_CH0CCR</displayName>
          <description>GPTM_CH0CCR</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH0CCV</name>
              <description>CH0CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM0_CH1CCR-->
        <register>
          <name>GPTM_CH1CCR</name>
          <displayName>GPTM_CH1CCR</displayName>
          <description>GPTM_CH1CCR</description>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH1CCV</name>
              <description>CH1CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM0_CH2CCR-->
        <register>
          <name>GPTM_CH2CCR</name>
          <displayName>GPTM_CH2CCR</displayName>
          <description>GPTM_CH2CCR</description>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH2CCV</name>
              <description>CH2CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM0_CH3CCR-->
        <register>
          <name>GPTM_CH3CCR</name>
          <displayName>GPTM_CH3CCR</displayName>
          <description>GPTM_CH3CCR</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH3CCV</name>
              <description>CH3CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM0_CH0ACR-->
        <register>
          <name>GPTM_CH0ACR</name>
          <displayName>GPTM_CH0ACR</displayName>
          <description>GPTM_CH0ACR</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH0ACV</name>
              <description>CH0ACV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM0_CH1ACR-->
        <register>
          <name>GPTM_CH1ACR</name>
          <displayName>GPTM_CH1ACR</displayName>
          <description>GPTM_CH1ACR</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH1ACV</name>
              <description>CH1ACV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM0_CH2ACR-->
        <register>
          <name>GPTM_CH2ACR</name>
          <displayName>GPTM_CH2ACR</displayName>
          <description>GPTM_CH2ACR</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH2ACV</name>
              <description>CH2ACV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM0_CH3ACR-->
        <register>
          <name>GPTM_CH3ACR</name>
          <displayName>GPTM_CH3ACR</displayName>
          <description>GPTM_CH3ACR</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH3ACV</name>
              <description>CH3ACV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--GPTM1-->
    <peripheral derivedFrom="GPTM0">
      <name>GPTM1</name>
      <description>GPTM1</description>
      <baseAddress>0x4006F000</baseAddress>
      <interrupt>
        <name>GPTM1</name>
        <value>36</value>
      </interrupt>
    </peripheral>
    <!--BFTM0-->
    <peripheral>
      <name>BFTM0</name>
      <version>1.1</version>
      <description>BFTM0</description>
      <groupName>BFTM</groupName>
      <baseAddress>0x40076000</baseAddress>
      <size>32</size><!--Bits-->
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size><!--Bytes-->
        <usage>registers</usage><!--registers/buffer/reserved-->
      </addressBlock>
      <interrupt>
        <name>BFTM0</name>
        <value>41</value>
      </interrupt>
      <registers>
        <!--BFTM0_CR-->
        <register>
          <name>BFTM_CR</name>
          <displayName>BFTM_CR</displayName>
          <description>BFTM_CR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>MIEN</name>
              <description>MIEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>OSM</name>
              <description>OSM</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CEN</name>
              <description>CEN</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--BFTM0_SR-->
        <register>
          <name>BFTM_SR</name>
          <displayName>BFTM_SR</displayName>
          <description>BFTM_SR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>MIF</name>
              <description>MIF</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--BFTM0_CNTR-->
        <register>
          <name>BFTM_CNTR</name>
          <displayName>BFTM_CNTR</displayName>
          <description>BFTM_CNTR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CNTR</name>
              <description>CNTR</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--BFTM0_CMPR-->
        <register>
          <name>BFTM_CMPR</name>
          <displayName>BFTM_CMPR</displayName>
          <description>BFTM_CMPR</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CMP</name>
              <description>CMP</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
